{
  "_name_or_path": "DunnBC22/dit-base-Business_Documents_Classified_v2",
  "architectures": [
    "BeitForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "auxiliary_channels": 256,
  "auxiliary_concat_input": false,
  "auxiliary_loss_weight": 0.4,
  "auxiliary_num_convs": 1,
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "specification",
    "1": "email",
    "2": "advertisement",
    "3": "handwritten",
    "4": "scientific_report",
    "5": "budget",
    "6": "scientific_publication",
    "7": "presentation",
    "8": "file_folder",
    "9": "memo",
    "10": "resume",
    "11": "invoice",
    "12": "letter",
    "13": "questionnaire",
    "14": "form",
    "15": "news_article"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "advertisement": 2,
    "budget": 5,
    "email": 1,
    "file_folder": 8,
    "form": 14,
    "handwritten": 3,
    "invoice": 11,
    "letter": 12,
    "memo": 9,
    "news_article": 15,
    "presentation": 7,
    "questionnaire": 13,
    "resume": 10,
    "scientific_publication": 6,
    "scientific_report": 4,
    "specification": 0
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 0.1,
  "model_type": "beit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "out_indices": [
    3,
    5,
    7,
    11
  ],
  "patch_size": 16,
  "pool_scales": [
    1,
    2,
    3,
    6
  ],
  "problem_type": "single_label_classification",
  "semantic_loss_ignore_index": 255,
  "torch_dtype": "float32",
  "transformers_version": "4.32.1",
  "use_absolute_position_embeddings": true,
  "use_auxiliary_head": true,
  "use_mask_token": true,
  "use_mean_pooling": true,
  "use_relative_position_bias": false,
  "use_shared_relative_position_bias": false,
  "vocab_size": 8192
}
